Documentation/Source/Panelists_Guide.org
#+TITLE: Panelists Guide for Zambia
#+EMAIL: NELA.Percy@gmail.com
#+AUTHOR: Percy
#+DATE: March 2012
#+DESCRIPTION: Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting panelists in the use of the Zambia FFF-branch instance for your conference.  This is still a work in progress.
#+MACRO: DESCRIPTION Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting panelists in the use of the Zambia FFF-branch instance for your conference.  This is still a work in progress.
#+KEYWORDS: Zambia, Documentation, FFF branch
#+META: KEYWORDS Zambia, Documentation, FFF branch
#+LANGUAGE: en
#+OPTIONS: \n:nil ^:nil timestamp:nil creator:nil H:3 num:3 toc:nil @:t ::nil |:t -:t todo:nil tasks:nil tags:nil <:t *:t author:t email:t skip:nil d:t f:t pri:t
#+STARTUP: fninline
#+SETUPFILE: "Headers/setupfile.org"
#+INCLUDE: "Headers/include.org"
#+TOC: headlines 3
#+LaTeX: \newpage
#+LaTeX: \pagenumbering{arabic}
* Introduction

  Zambia is the system used by this convention to organize and
  schedule our content.  Logging into Zambia as a participant allows
  panelists to indicate which panels they would like to be on, set
  their availability during the convention and create a
  profile/biography.
* First login/Welcome
#+LaTeX: \label{welcome.php}
#+HTML: <A NAME="welcome.php" ID="welcome.php"></A>
#+LaTeX: \underline{
  [[../webpages/welcome.php][Welcome]]
#+LaTex: }

  The first page you see, when you log in will have a lot of
  important, and general information on it.  Please read it, and let
  your liaisons know if you have any issues.

* My Profile
#+LaTeX: \label{my_contact.php}
#+HTML: <A NAME="my_contact.php" ID="my_contact.php"></A>
#+LaTeX: \underline{
  [[../webpages/my_contact.php][My Profile]]
#+LaTex: }

  When you log in for the first time, you will need to update your
  profile and change your password away from the default, or the
  password sent upon reset. This can be done by clicking "profile" on the menu bar.

  From this page you can do the following:
  + Let us know if you are interested and able to participate in
    programming for the upcoming convention:
    + If you want to be on panels or otherwise be a program
      participant, set it to "Yes".
    + If you are unable to attend this event, but want to be invited
      for future events, please still log in and set it to "No".
  + Let us know if we can share your e-mail address with other
    participants.  Please consider saying yes, so that moderators of
    the panels you have been selected for can contact you prior to the
    convention to let you know their format, so you can discuss and
    prep for the panel.  Saying no will not affect our decisions when
    making panelist selections for the panels.
  + Let us know if we can photograph you while you are participating
    on the panels, and if we can use those images in the promotion of
    the convention.  Saying no will not affect our decisions when
    making panelist selections for panels.
  + Let us know how you want your name and other bio information to
    appear in our electronic and print publications.  If you have
    questions about this, please contact your liaison.  This
    information will be presented, with what we currently have for
    you, and gives you space to change it.  When and if you change
    your bios information, either your liaison, or a bios editor might
    be in touch, if there is any further changes we might suggest.
  + Review the contact information we have for you.
* My Availability
#+LaTeX: \label{my_sched_constr.php}
#+HTML: <A NAME="my_sched_constr.php" ID="my_sched_constr.php"></A>
#+LaTeX: \underline{
  [[../webpages/my_sched_constr.php][My Availability]]
#+LaTex: }

  Next, please let us know about the times you are available to be on
  panels, and the number of panels you are willing to be on, by
  selecting the "availability" option from the menu in the page
  header. This allows us to get an idea of what kind of schedule you
  would like to have during the convention. In addition to listing
  time ranges, make sure to enter information on any constraints or
  conflicts that might occur on your schedule at the bottom of the
  page. Be as thorough as you can and fill out all fields on this page
  -- the more information we have, the better! Please keep in mind
  that a narrow availability listing makes it difficult for our staff
  to schedule you, so please be both honest and realistic about your
  con participation time!
