Documentation/Panelists_Guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Panelists Guide for Zambia</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Percy" />
<meta  name="description" content="Zambia is a piece of Conference Management Software.  This document is a &quot;How To&quot; guide assisting panelists in the use of the Zambia FFF-branch instance for your conference.  This is still a work in progress."
 />
<meta  name="keywords" content="Zambia, Documentation, FFF branch" />
</head>
<body>
<div id="content">
<h1 class="title">Panelists Guide for Zambia</h1>
<p>
Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting panelists in the use of the Zambia FFF-branch instance for your conference.  This is still a work in progress.
</p>
<p>
Panelists Guide for Zambia
</p>
<p>
Percy &lt;NELA.Percy@gmail.com&gt;
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. First login/Welcome</a></li>
<li><a href="#sec-3">3. My Profile</a></li>
<li><a href="#sec-4">4. My Availability</a></li>
<li><a href="#sec-5">5. Search Panels</a></li>
<li><a href="#sec-6">6. My Panel Interests</a></li>
<li><a href="#sec-7">7. My General Interests</a></li>
<li><a href="#sec-8">8. My Schedule</a></li>
<li><a href="#sec-9">9. Contact</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Zambia is the system used by this convention to organize and
schedule our content.  Logging into Zambia as a participant allows
panelists to indicate which panels they would like to be on, set
their availability during the convention and create a
profile/biography.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> First login/Welcome</h2>
<div class="outline-text-2" id="text-2">
<A NAME="welcome.php" ID="welcome.php"></A>
<p>
<a href="../webpages/welcome.php">Welcome</a>
</p>
<p>
The first page you see, when you log in will have a lot of
important, and general information on it.  Please read it, and let
your liaisons know if you have any issues.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> My Profile</h2>
<div class="outline-text-2" id="text-3">
<A NAME="my_contact.php" ID="my_contact.php"></A>
<p>
<a href="../webpages/my_contact.php">My Profile</a>
</p>
<p>
When you log in for the first time, you will need to update your
profile and change your password away from the default, or the
password sent upon reset. This can be done by clicking "profile" on the menu bar.
</p>

<p>
From this page you can do the following:
</p>
<ul class="org-ul">
<li>Let us know if you are interested and able to participate in
programming for the upcoming convention:
<ul class="org-ul">
<li>If you want to be on panels or otherwise be a program
participant, set it to "Yes".
</li>
<li>If you are unable to attend this event, but want to be invited
for future events, please still log in and set it to "No".
</li>
</ul>
</li>
<li>Let us know if we can share your e-mail address with other
participants.  Please consider saying yes, so that moderators of
the panels you have been selected for can contact you prior to the
convention to let you know their format, so you can discuss and
prep for the panel.  Saying no will not affect our decisions when
making panelist selections for the panels.
</li>
<li>Let us know if we can photograph you while you are participating
on the panels, and if we can use those images in the promotion of
the convention.  Saying no will not affect our decisions when
making panelist selections for panels.
</li>
<li>Let us know how you want your name and other bio information to
appear in our electronic and print publications.  If you have
questions about this, please contact your liaison.  This
information will be presented, with what we currently have for
you, and gives you space to change it.  When and if you change
your bios information, either your liaison, or a bios editor might
be in touch, if there is any further changes we might suggest.
</li>
<li>Review the contact information we have for you.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> My Availability</h2>
<div class="outline-text-2" id="text-4">
<A NAME="my_sched_constr.php" ID="my_sched_constr.php"></A>
<p>
<a href="../webpages/my_sched_constr.php">My Availability</a>
</p>
<p>
Next, please let us know about the times you are available to be on
panels, and the number of panels you are willing to be on, by
selecting the "availability" option from the menu in the page
header. This allows us to get an idea of what kind of schedule you
would like to have during the convention. In addition to listing
time ranges, make sure to enter information on any constraints or
conflicts that might occur on your schedule at the bottom of the
page. Be as thorough as you can and fill out all fields on this page
&#x2013; the more information we have, the better! Please keep in mind
that a narrow availability listing makes it difficult for our staff
to schedule you, so please be both honest and realistic about your
con participation time!
</p>
</div>
</div>
