Documentation/Source/Panelists_Guide.tex
\documentclass[captions=tablesignature]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\setcounter{secnumdepth}{3}
\author{Percy\thanks{NELA.Percy@gmail.com}}
\date{March 2012}
\title{Panelists Guide for Zambia}
\hypersetup{
  pdfkeywords={Zambia, Documentation, FFF branch},
  pdfsubject={Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting panelists in the use of the Zambia FFF-branch instance for your conference.  This is still a work in progress.},
  pdfcreator={}}
\begin{document}

\maketitle
\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{0pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{}
\cfoot{}
\rfoot{}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}
Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting panelists in the use of the Zambia FFF-branch instance for your conference.  This is still a work in progress.
\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\renewcommand{\footrulewidth}{1pt}
\chead{
Panelists Guide for Zambia
}
\lfoot{
Percy <NELA.Percy@gmail.com>
}
\rfoot{\thepage}
\setcounter{tocdepth}{3}
\tableofcontents
\newpage
\pagenumbering{arabic}
\section{Introduction}
\label{sec-1}

Zambia is the system used by this convention to organize and
schedule our content.  Logging into Zambia as a participant allows
panelists to indicate which panels they would like to be on, set
their availability during the convention and create a
profile/biography.

\section{First login/Welcome}
\label{sec-2}
\label{welcome.php}
\underline{
\href{../webpages/welcome.php}{Welcome}
}

The first page you see, when you log in will have a lot of
important, and general information on it.  Please read it, and let
your liaisons know if you have any issues.
\section{My Profile}
\label{sec-3}
\label{my_contact.php}
\underline{
\href{../webpages/my_contact.php}{My Profile}
}

When you log in for the first time, you will need to update your
profile and change your password away from the default, or the
password sent upon reset. This can be done by clicking "profile" on the menu bar.

From this page you can do the following:
\begin{itemize}
\item Let us know if you are interested and able to participate in
programming for the upcoming convention:
\begin{itemize}
\item If you want to be on panels or otherwise be a program
participant, set it to "Yes".
\item If you are unable to attend this event, but want to be invited
for future events, please still log in and set it to "No".
\end{itemize}
\item Let us know if we can share your e-mail address with other
participants.  Please consider saying yes, so that moderators of
the panels you have been selected for can contact you prior to the
convention to let you know their format, so you can discuss and
prep for the panel.  Saying no will not affect our decisions when
making panelist selections for the panels.
\item Let us know if we can photograph you while you are participating
on the panels, and if we can use those images in the promotion of
the convention.  Saying no will not affect our decisions when
making panelist selections for panels.
\item Let us know how you want your name and other bio information to
appear in our electronic and print publications.  If you have
questions about this, please contact your liaison.  This
information will be presented, with what we currently have for
you, and gives you space to change it.  When and if you change
your bios information, either your liaison, or a bios editor might
be in touch, if there is any further changes we might suggest.
\item Review the contact information we have for you.
\end{itemize}

\section{My Availability}
\label{sec-4}
\label{my_sched_constr.php}
\underline{
\href{../webpages/my_sched_constr.php}{My Availability}
}

Next, please let us know about the times you are available to be on
panels, and the number of panels you are willing to be on, by
selecting the "availability" option from the menu in the page
header. This allows us to get an idea of what kind of schedule you
would like to have during the convention. In addition to listing
time ranges, make sure to enter information on any constraints or
conflicts that might occur on your schedule at the bottom of the
page. Be as thorough as you can and fill out all fields on this page
-- the more information we have, the better! Please keep in mind
that a narrow availability listing makes it difficult for our staff
to schedule you, so please be both honest and realistic about your
con participation time!
