Documentation/Source/Panelists_Guide.org
* Search Panels
#+LaTeX: \label{my_sessions1.php}
#+HTML: <A NAME="my_sessions1.php" ID="my_sessions1.php"></A>
#+LaTeX: \underline{
  [[../webpages/my_sessions1.php][Search Panels]]
#+LaTex: }

  Next up is "Search Panels"; this is how you find out what sort of
  panels and other program items are available for
  participation. Because of the volume of selections that are
  available at this convention, we organize panels by tracks. There
  are no restrictions on how many tracks a person can participate on;
  we love panelists that have knowledge in several content areas and
  can participate on a diverse range of items!

  From the "Search Panels" page you can do the following:
  + Click the drop menu on the "Track" option. This will show you a
    list of all our tracks or if there is a specific panel number that
    can be selected as well.
  + Once you have made your selections, click "Search". This will give
    you a list of panel options that match your selection.
  + Each entry has a box next to the title that you click on to add it
    as a panel you are interested in participating in.
  + Once you have made your selections, click "Save". You will be taken
    to a page where you can enter a rating and give reasons as to why
    you would be a good choice for a given panel (see the section
    [[My Panel Interests]] below).
  + Go back to the "Search Panels" page to add more panels to your
    list, either from the same track, or other tracks.
* My Panel Interests
#+LaTeX: \label{PartPanelInterests.php}
#+HTML: <A NAME="PartPanelInterests.php" ID="PartPanelInterests.php"></A>
#+LaTeX: \underline{
  [[../webpages/PartPanelInterests.php][My Panel Interests]]
#+LaTex: }

  Once you have selected a bunch of panels you are interested in
  participating in, it is time to provide us with information for why
  we should place YOU on that panel.  This is a really important step!
  We have so many great panelists that sign up each event, so we rarely
  assign people to panels who have not ranked the panel and given
  reason as to why they would be a fabulous addition to this panel.

  Click on the "My Panel Interests" option from the menu to view all
  the panels you have previously selected.
  + First, go through and rank all your panel selections. We use the
    following rating system:
    + 1 -- Oooh! Oh! Pick Me!
    + 2-3 -- I'd like to if I can.
    + 4-5 -- I am qualified but this is not one of my primary
      interests.
    You are limited to 4 sessions each of preferences 1-4 and there is
    no limit to the number of sessions for which you can express
    preference 5.
  + Next, for each panel, write in the text boxes to let us know
    why you would be fabulous on that session.
    + Completing this step thoughtfully is especially important for
      the items you rank highest.
    + Address anything asked of panelists in the beige box associated
      with that panel.
    + This does not need to be long -- a short paragraph is typical.
    + Some panelists draft these out in a separate document and then
      cut-and-paste their entries into Zambia as a final step.
    + If you do not fill this section out, you might not get placed on
      the panel, even if you rate it a 1 and feel that you are an
      obvious choice.
  + If you are interested in moderating a particular panel, please
    select that option while providing your rankings.  The panelists
    most enthusiastic about a topic do not always make the best
    moderators, as moderators are facilitators in addition to
    contributors on a panel. So keep this in mind when ranking and
    indicating your interest in moderating.
  + Remember to save your progress approximately every ten minutes, so
    that you are not logged out due to inactivity and lose your
    selections or what you wrote!
  + Ranking a panel as "1" and writing a thesis on why you are perfect
    for the panel does not guarantee your placement on it. Most of our
    panels have more qualified people sign up for them than we have
    spaces on the panel (typically 4-5), and there are more sessions
    to sign up for than we have spots in the schedule.
* My General Interests
#+LaTeX: \label{my_interests.php}
#+HTML: <A NAME="my_interests.php" ID="my_interests.php"></A>
#+LaTeX: \underline{
  [[../webpages/my_interests.php][My General Interests]]
#+LaTex: }

  The next section you will want fill out is "General Interests". This
  page is where you can provide information pertaining to your
  interests, workshops or presentations you would like to pitch to us,
  who you would like to be on panels with, and/or who you want to
  avoid.  This is also the place to give us other information we
  should consider when creating this event's programming schedule.

  Some people find that it is best to fill out this section last,
  after completing all other parts of the panel sign-up process.  You
  should feel free to come back to it at the end.
