Documentation/Panelists_Guide.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Search Panels</h2>
<div class="outline-text-2" id="text-5">
<A NAME="my_sessions1.php" ID="my_sessions1.php"></A>
<p>
<a href="../webpages/my_sessions1.php">Search Panels</a>
</p>
<p>
Next up is "Search Panels"; this is how you find out what sort of
panels and other program items are available for
participation. Because of the volume of selections that are
available at this convention, we organize panels by tracks. There
are no restrictions on how many tracks a person can participate on;
we love panelists that have knowledge in several content areas and
can participate on a diverse range of items!
</p>

<p>
From the "Search Panels" page you can do the following:
</p>
<ul class="org-ul">
<li>Click the drop menu on the "Track" option. This will show you a
list of all our tracks or if there is a specific panel number that
can be selected as well.
</li>
<li>Once you have made your selections, click "Search". This will give
you a list of panel options that match your selection.
</li>
<li>Each entry has a box next to the title that you click on to add it
as a panel you are interested in participating in.
</li>
<li>Once you have made your selections, click "Save". You will be taken
to a page where you can enter a rating and give reasons as to why
you would be a good choice for a given panel (see the section
<a href="#sec-6">6</a> below).
</li>
<li>Go back to the "Search Panels" page to add more panels to your
list, either from the same track, or other tracks.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> My Panel Interests</h2>
<div class="outline-text-2" id="text-6">
<A NAME="PartPanelInterests.php" ID="PartPanelInterests.php"></A>
<p>
<a href="../webpages/PartPanelInterests.php">My Panel Interests</a>
</p>
<p>
Once you have selected a bunch of panels you are interested in
participating in, it is time to provide us with information for why
we should place YOU on that panel.  This is a really important step!
We have so many great panelists that sign up each event, so we rarely
assign people to panels who have not ranked the panel and given
reason as to why they would be a fabulous addition to this panel.
</p>

<p>
Click on the "My Panel Interests" option from the menu to view all
the panels you have previously selected.
</p>
<ul class="org-ul">
<li>First, go through and rank all your panel selections. We use the
following rating system:
<ul class="org-ul">
<li>1 &#x2013; Oooh! Oh! Pick Me!
</li>
<li>2-3 &#x2013; I'd like to if I can.
</li>
<li>4-5 &#x2013; I am qualified but this is not one of my primary
interests.
</li>
</ul>
<p>
You are limited to 4 sessions each of preferences 1-4 and there is
no limit to the number of sessions for which you can express
preference 5.
</p>
</li>
<li>Next, for each panel, write in the text boxes to let us know
why you would be fabulous on that session.
<ul class="org-ul">
<li>Completing this step thoughtfully is especially important for
the items you rank highest.
</li>
<li>Address anything asked of panelists in the beige box associated
with that panel.
</li>
<li>This does not need to be long &#x2013; a short paragraph is typical.
</li>
<li>Some panelists draft these out in a separate document and then
cut-and-paste their entries into Zambia as a final step.
</li>
<li>If you do not fill this section out, you might not get placed on
the panel, even if you rate it a 1 and feel that you are an
obvious choice.
</li>
</ul>
</li>
<li>If you are interested in moderating a particular panel, please
select that option while providing your rankings.  The panelists
most enthusiastic about a topic do not always make the best
moderators, as moderators are facilitators in addition to
contributors on a panel. So keep this in mind when ranking and
indicating your interest in moderating.
</li>
<li>Remember to save your progress approximately every ten minutes, so
that you are not logged out due to inactivity and lose your
selections or what you wrote!
</li>
<li>Ranking a panel as "1" and writing a thesis on why you are perfect
for the panel does not guarantee your placement on it. Most of our
panels have more qualified people sign up for them than we have
spaces on the panel (typically 4-5), and there are more sessions
to sign up for than we have spots in the schedule.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> My General Interests</h2>
<div class="outline-text-2" id="text-7">
<A NAME="my_interests.php" ID="my_interests.php"></A>
<p>
<a href="../webpages/my_interests.php">My General Interests</a>
</p>
<p>
The next section you will want fill out is "General Interests". This
page is where you can provide information pertaining to your
interests, workshops or presentations you would like to pitch to us,
who you would like to be on panels with, and/or who you want to
avoid.  This is also the place to give us other information we
should consider when creating this event's programming schedule.
</p>

<p>
Some people find that it is best to fill out this section last,
after completing all other parts of the panel sign-up process.  You
should feel free to come back to it at the end.
</p>
</div>
</div>
