Documentation/Source/Panelists_Guide.org
* My Schedule
#+LaTeX: \label{MySchedule.php}
#+HTML: <A NAME="MySchedule.php" ID="MySchedule.php"></A>
#+LaTeX: \underline{
  [[../webpages/MySchedule.php][My Schedule]]
#+LaTex: }

  This page gives you your schedule for this event followed by your
  schedule and feedback from previous events.  It also has links for
  an ical (for your phone/tablet/computer calendar) and a printable
  schedule.  Your schedule should also be in your panelist packet.
* Contact

  There should be a contact email at the bottom of each page, if you
  need help or assistance.  Also, please reach out to your liaison at
  any time if you need more information, or anything.
