Documentation/Panelists_Guide.html

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> My Schedule</h2>
<div class="outline-text-2" id="text-8">
<A NAME="MySchedule.php" ID="MySchedule.php"></A>
<p>
<a href="../webpages/MySchedule.php">My Schedule</a>
</p>
<p>
This page gives you your schedule for this event followed by your
schedule and feedback from previous events.  It also has links for
an ical (for your phone/tablet/computer calendar) and a printable
schedule.  Your schedule should also be in your panelist packet.
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Contact</h2>
<div class="outline-text-2" id="text-9">
<p>
There should be a contact email at the bottom of each page, if you
need help or assistance.  Also, please reach out to your liaison at
any time if you need more information, or anything.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: March 2012</p>
<p class="author">Author: Percy</p>
<p class="email">Email: <a href="mailto:NELA.Percy@gmail.com">NELA.Percy@gmail.com</a></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>