Documentation/Source/Panelists_Guide.tex

\section{My Schedule}
\label{sec-8}
\label{MySchedule.php}
\underline{
\href{../webpages/MySchedule.php}{My Schedule}
}

This page gives you your schedule for this event followed by your
schedule and feedback from previous events.  It also has links for
an ical (for your phone/tablet/computer calendar) and a printable
schedule.  Your schedule should also be in your panelist packet.

\section{Contact}
\label{sec-9}

There should be a contact email at the bottom of each page, if you
need help or assistance.  Also, please reach out to your liaison at
any time if you need more information, or anything.
\end{document}